Security Group 추가 및 ARCHITECTURE 수정
